app/views/movies/index.html.erb

          <ul class="list-group">
             <% movie.showtimes.each do |showtime| %>
---
SELECT "showtimes".* FROM "showtimes" WHERE "showtimes"."movie_id" = $1  [["movie_id", 1]]