app/views/showtimes/new.html.erb

SELECT "movies".* FROM "movies"
---
        <div class="form-group">
          Movies <p><%= f.collection_select :movie_id, Movie.all, :id, :title, class: "form-control col-sm-6" %></p>