app/controllers/orders_controller.rb

  def index
    if params[:search]
      @orders = Order.movie_search(params[:search])
    else
      @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def new
    @order = Order.new
    @showtime = Showtime.find(params[:showtime])
---
SELECT  "showtimes".* FROM "showtimes" WHERE "showtimes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @showtime = Showtime.find(order_params[:showtime_id])
    @order = Order.new(order_params)
    if @order.save
---
SELECT  "showtimes".* FROM "showtimes" WHERE "showtimes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "orders" ("name", "email", "credit_card", "expiration", "total", "showtime_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"