app/controllers/showtimes_controller.rb

SELECT "showtimes".* FROM "showtimes" ORDER BY "showtimes"."showdate" ASC
---
  def index
    @showtimes = Showtime.all.order(:showdate)

INSERT INTO "showtimes" ("showdate", "start_time", "end_time", "tickets_sold", "movie_id", "auditorium_id", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
   @showtime = Showtime.new(showtime_params)
    if @showtime.save